Revit 2027 API
CoordinationModelLinkUtils.SetVisibilityOverrideForReferenceInsideCoordinationModel Method
 Sets the visibility override for the provided reference inside the Coordination Model instance. A value of true means that the graphics are visible.
Namespace: Autodesk.Revit.DB.ExternalData
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static void SetVisibilityOverrideForReferenceInsideCoordinationModel(
	Document document,
	View view,
	Element coordinationModelInstance,
	Reference reference,
	bool visible
)
Public Shared Sub SetVisibilityOverrideForReferenceInsideCoordinationModel (
	document As Document,
	view As View,
	coordinationModelInstance As Element,
	reference As Reference,
	visible As Boolean
)
public:
static void SetVisibilityOverrideForReferenceInsideCoordinationModel(
	Document^ document,
	View^ view,
	Element^ coordinationModelInstance,
	Reference^ reference,
	bool visible
)
static member SetVisibilityOverrideForReferenceInsideCoordinationModel :
        document : Document *
        view : View *
        coordinationModelInstance : Element *
        reference : Reference *
        visible : bool -> unit
Parameters
document Document
 The document.
view View
 The view.
coordinationModelInstance Element
 The Coordination Model instance element where the provided reference is found.
reference Reference
 The reference to the element inside the provided Coordination Model instance.
visible Boolean
 Sets the visibility override for the provided reference inside the Coordination Model instance. A value of true means that the graphics are visible.
Exceptions
Exception | Condition
ArgumentException |  document is not a project document. -or- The element coordinationModelInstance was not found in the given document. -or- The provided Reference is not a valid element inside the provided Coordination Model instance.
ArgumentNullException |  A non-optional argument was null
InvalidOperationException |  The document is in failure mode: an operation has failed, and Revit requires the user to either cancel the operation or fix the problem (usually by deleting certain elements).
ModificationForbiddenException |  The document is in failure mode: an operation has failed, and Revit requires the user to either cancel the operation or fix the problem (usually by deleting certain elements). -or- The document is being loaded, or is in the midst of another sensitive process.
ModificationOutsideTransactionException |  The document has no open transaction.
Remarks
 The reference should be a subelement of a Coordination Model from Autodesk Docs.
 The referenced element will have its visibility updated in all instances of the Coordination Model type of the provided Coordination Model instance.
 By default, the visibility setting has no override and its value is true.
See Also
Reference
CoordinationModelLinkUtils Class
Autodesk.Revit.DB.ExternalData Namespace